Repository: BAMWelDX/weldx-widgets
Catalog: weldx_widgets/locale/*/LC_MESSAGES/*.po
Languages: de

source: Hydrogen
de: Wasserstoff

source: Oxygen
de: Sauerstoff

source: Add gas component
de: Gas hinzufügen

source: percentage
de: Prozent

source: delete
de: löschen

source: Flow rate
de: Flußrate

source: time
de: Zeit

source: Manufacturer
de: Hersteller

source: Power source
de: Stromquelle

source: Wire feed rate
de: Drahtvorschubrate

source: Pulse duration
de: Pulsdauer

source: Pulse frequency
de: Pulsfrequenz

source: Base current
de: Grundstromstärke

source: Pulse voltage
de: Pulsspannung

source: Pulse current
de: Pulsstromstärke

source: Pulsed
de: Gepulst

source: process parameters
de: Prozessparameter

source: Impedance
de: Impedanz

source: Characteristic
de: Charakteristisch

source: Spray process parameters
de: Sprühlichtbogen Parameter

source: Diameter
de: Durchmesser

source: Class
de: Klasse

source: Metadata
de: Metadaten

source: Wire parameters
de: Drahtparameter

source: Spray
de: Sprüh

source: Process type
de: Prozesstyp

source: GMAW process parameters
de: GMAW Prozessparameter

source: Shielding gas
de: Schutzgas

source: unknown process type
de: Unbekannter Prozesstyp

source: voltage/current
de: Spannung/Stromstärke

source: current
de: Stromstärke

source: invoke next step
de: Nächster Schritt

source: Save results
de: Speichern

source: Save
de: Speichern

source: Select
de: Auswählen

source: Change
de: Ändern

source: Export geometry to CAD file [optional]
de: CAD-Export [optional]

source: Data format
de: Datenformat

source: Create program
de: Programm erstellen

source: Profile raster width
de: Breite Profilraster

source: Trace raster width
de: Breite Spurraster

source: Download program
de: Lade Program

source: Common name
de: Allgemeiner Name

source: Thickness
de: Dicke

source: Base metal
de: Grundmetal

source: Groove type
de: Fugentyp

source: profile
de: Profil

source: ISO 9692-1 Groove selection
de: ISO 9692-1 Fugenauswahl

source: Code number
de: Kodenummer

source: angle
de: Winkel

source: workpiece_thickness
de: Werkstückdicke

source: code_number
de: Kodenummer

source: Seam length
de: Nahtlänge

source: weld speed
de: Schweißgeschwindigkeit

source: Welding parameters
de: Schweißparameter

source: Measurements
de: Messungen

source: Measurement chain
de: Messkette

source: Process parameters
de: Prozessparameter

source: ASDF-header
de: ASDF-Dateikopf

source: Specimen
de: Werkstück

source: Difference in welding speed
de: Unterschied Schweißgeschwindigkeit

source: time in s
de: Zeit in s

source: diff in mm
de: Unterschied in mm

source: User frame deviation
de: Abweichung Nutzerrahmen

source: Groove angle
de: Fugenwinkel

source: Workpiece thickness
de: Dicke Werkstück

source: Root face
de: Wurzelzone

source: Root gap
de: Wurzellücke

source: Bevel angle
de: Keilwinkel

source: Bevel radius
de: Keilradius

source: Special depth
de: Spezialtiefe

source: Choose a groove and your linear weld seam parameters.
de: Wähle Fugen- und lineare Schweißbewegungsparameter.

source: Here you can choose from various shielding gases and spray and pulsed MIG processes and its parameters.
de: Hier können Sie verschiedene Prozessparameter, wie Schutzgase und Sprüh/Pulslichtbogenparameter einstellen.

source: Welding process type and parameters
de: Schweißprozessparameter
